dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/sdk_defs.h
/**
 * \addtogroup PLA_BSP_SYSTEM
 * \{
 * \addtogroup BSP_DEFINITIONS SDK Platform Definitions
 *
 * \brief Platform definitions
 *
 * \{
 */

/**
 ****************************************************************************************
 *
 * @file sdk_defs.h
 *
 * @brief Central include header file with platform definitions.
 *
 * Copyright (C) 2015-2023 Renesas Electronics Corporation and/or its affiliates.
 * All rights reserved. Confidential Information.
 *
 * This software ("Software") is supplied by Renesas Electronics Corporation and/or its
 * affiliates ("Renesas"). Renesas grants you a personal, non-exclusive, non-transferable,
 * revocable, non-sub-licensable right and license to use the Software, solely if used in
 * or together with Renesas products. You may make copies of this Software, provided this
 * copyright notice and disclaimer ("Notice") is included in all such copies. Renesas
 * reserves the right to change or discontinue the Software at any time without notice.
 *
 * THE SOFTWARE IS PROVIDED "AS IS". RENESAS DISCLAIMS ALL WARRANTIES OF ANY KIND,
 * WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE
 * MAXIMUM EXTENT PERMITTED UNDER LAW, IN NO EVENT SHALL RENESAS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE, EVEN IF RENESAS HAS BEEN ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGES. USE OF THIS SOFTWARE MAY BE SUBJECT TO TERMS AND CONDITIONS CONTAINED IN
 * AN ADDITIONAL AGREEMENT BETWEEN YOU AND RENESAS. IN CASE OF CONFLICT BETWEEN THE TERMS
 * OF THIS NOTICE AND ANY SUCH ADDITIONAL LICENSE AGREEMENT, THE TERMS OF THE AGREEMENT
 * SHALL TAKE PRECEDENCE. BY CONTINUING TO USE THIS SOFTWARE, YOU AGREE TO THE TERMS OF
 * THIS NOTICE.IF YOU DO NOT AGREE TO THESE TERMS, YOU ARE NOT PERMITTED TO USE THIS
 * SOFTWARE.
 *
 ****************************************************************************************
 */

#ifndef __SDK_DEFS_H__
#define __SDK_DEFS_H__

#include <stddef.h>

#ifdef __cplusplus
 extern "C" {
#endif

#ifdef __GNUC__
#  define GCC_VERSION (__GNUC__ * 10000 \
                               + __GNUC_MINOR__ * 100 \
                               + __GNUC_PATCHLEVEL__)
/* assert gcc version is at least 4.9.3 */
#  if GCC_VERSION < 40903
#    error "Please use gcc version 4.9.3 or newer!"
#  endif
#endif

#   include "DA1459x-00.h"

#include "system_DA1459x.h"                         /* DA1459x System */

/**
 *  \brief MTB-related macros
 *
 *  MTB_MASTER_REG:                 Address of MTB_MASTER register
 *  MTB_MASTER_REG_DISABLE_VAL:     Value to be written to MTB_MASTER in order to disable the MTB
 */
#define MTB_MASTER_REG                          ((uint32_t *) 0xE0043004)
#define MTB_MASTER_REG_DISABLE_VAL              (dg_configMTB_MASK)


/************************
 * Memory map
 ************************/

/**
 * \brief Remapped device base address.
 */
#define MEMORY_REMAPPED_BASE    0x00000000UL
 /* The max remapped  region size according to FLASH_REGION_SIZE register field */
#define MEMORY_REMAPPED_END     0x02000000UL

/**
 * \brief Remapped device memory size.
 */
#define MEMORY_REMAPPED_SIZE    (MEMORY_REMAPPED_END - MEMORY_REMAPPED_BASE)

/**
 * \brief ROM base address.
 */
#define MEMORY_ROM_BASE         0x900000UL
#define MEMORY_ROM_END          (MEMORY_ROM_BASE + 0x48000L)

/**
 * \brief ROM memory size.
 */
#define MEMORY_ROM_SIZE         (MEMORY_ROM_END - MEMORY_ROM_BASE)

/**
 * \brief OTP memory base address.
 */

/**
 * \brief OTP memory size.
 */

/**
 * \brief SYSTEM RAM base address.
 */
#define MEMORY_SYSRAM_S_BASE    0x20000000UL
#define MEMORY_SYSRAM_S_END     (MEMORY_SYSRAM_S_BASE + 0x18000UL)

/**
 * \brief SYSTEM RAM size.
 */
#define MEMORY_SYSRAM_S_SIZE    (MEMORY_SYSRAM_S_END - MEMORY_SYSRAM_S_BASE)

/**
* \brief SYSTEM RAM (code) base address.
*/
#define MEMORY_SYSRAM_BASE      0x00800000UL
#define MEMORY_SYSRAM_END       (MEMORY_SYSRAM_BASE + 0x18000UL)

/**
* \brief SYSTEM RAM (code) size.
*/
#define MEMORY_SYSRAM_SIZE      (MEMORY_SYSRAM_END - MEMORY_SYSRAM_BASE)

/**
 * \brief CACHE RAM base address.
 */
#define MEMORY_CACHERAM_BASE    0x36000000UL
#define MEMORY_CACHERAM_END     0x36002000UL
#define MEMORY_CMAC_CACHERAM_BASE       0x40108000UL
#define MEMORY_CMAC_CACHERAM_END        0x4010A000UL

/**
 * \brief CACHE RAM size.
 */
#define MEMORY_CACHERAM_SIZE    (MEMORY_CACHERAM_END - MEMORY_CACHERAM_BASE)
#define MEMORY_CMAC_CACHERAM_SIZE       (MEMORY_CMAC_CACHERAM_END - MEMORY_CMAC_CACHERAM_BASE)

/**
 * \brief QSPI Flash base address.
 */
/**
  * QSPI AHB-C(ode) bus (cached). Accesses through this bus
  * are restricted according to CACHE_FLASH_REG.
  */
#define MEMORY_QSPIF_BASE       (0x16000000UL)
#define MEMORY_QSPIF_END        (MEMORY_QSPIF_BASE + 0x2000000UL)
/**
  * QSPI AHB-S(system) bus (Not cached). Accesses through this bus
  * are not affected by CACHE_FLASH_REG.
  */
#define MEMORY_QSPIF_S_BASE     (0x32000000UL)
#define MEMORY_QSPIF_S_END      (MEMORY_QSPIF_S_BASE + 0x2000000UL)

/**
 * \brief QSPI Flash memory size.
 */
#define MEMORY_QSPIF_SIZE       (MEMORY_QSPIF_END - MEMORY_QSPIF_BASE)

/**
 * eFlash AHB-C(ode) bus (cached). Accesses through this bus
 * are restricted according to CACHE_FLASH_REG.
 */
#define MEMORY_EFLASH_BASE (0xA00000UL)
#define MEMORY_EFLASH_END  (MEMORY_EFLASH_BASE + 0x40800UL)

/**
 * eFlash AHB-S(system) bus (Not cached). Accesses through this bus
 * are not affected by CACHE_FLASH_REG.
 */
#define MEMORY_EFLASH_S_BASE (0x31000000UL)
#define MEMORY_EFLASH_S_END  (MEMORY_EFLASH_S_BASE + 0x40800UL)

/**
 * \brief eFlash memory size.
 */
#define MEMORY_EFLASH_SIZE (MEMORY_EFLASH_END - MEMORY_EFLASH_BASE)

/**
 * \brief Primary product header base address
 */
#if defined(NVMS_PRODUCT_HEADER_PART_START)
# if (dg_configCODE_LOCATION == NON_VOLATILE_IS_EMBEDDED_FLASH) || \
     (dg_configCODE_LOCATION == NON_VOLATILE_IS_QSPI_FLASH)
#  define PRIMARY_PRODUCT_HEADER_BASE     (NVMS_PRODUCT_HEADER_PART_START)
# else
#  undef PRIMARY_PRODUCT_HEADER_BASE
# endif
#else
# if (dg_configCODE_LOCATION == NON_VOLATILE_IS_EMBEDDED_FLASH)
#  define PRIMARY_PRODUCT_HEADER_BASE     (EFLASH_MEM1_VIRTUAL_BASE_ADDR + 0x1000)
# elif (dg_configCODE_LOCATION == NON_VOLATILE_IS_QSPI_FLASH)
#  define PRIMARY_PRODUCT_HEADER_BASE     (QSPI_MEM1_VIRTUAL_BASE_ADDR + 0x1000)
# else
#  undef PRIMARY_PRODUCT_HEADER_BASE
# endif
#endif

/**
 * \brief Backup product header base address
 */
#if (dg_configCODE_LOCATION == NON_VOLATILE_IS_EMBEDDED_FLASH)
#  define BACKUP_PRODUCT_HEADER_BASE      (PRIMARY_PRODUCT_HEADER_BASE + 0x800)
#elif (dg_configCODE_LOCATION == NON_VOLATILE_IS_QSPI_FLASH)
#  define BACKUP_PRODUCT_HEADER_BASE      (PRIMARY_PRODUCT_HEADER_BASE + 0x1000)
#else
#  undef BACKUP_PRODUCT_HEADER_BASE
#endif


/**
 * \brief TRNG FIFO address
 */



/**
 * \brief OTP User Data Encryption Keys memory base address
 */
#define MEMORY_EFLASH_USER_DATA_KEYS_BASE               (0x00000800UL)
#define MEMORY_EFLASH_USER_DATA_KEYS_END                (0x00000900UL)
#define MEMORY_EFLASH_USER_DATA_KEYS_REVOCATION_BASE    (0x000007C0UL)
#define MEMORY_EFLASH_USER_DATA_KEYS_REVOCATION_END     (0x000007DFUL)
#define MEMORY_EFLASH_USER_DATA_KEY_SIZE                (0x20)


#define WITHIN_RANGE(_a, _s, _e)        (((uint32_t)(_a) >= (uint32_t)(_s)) && ((uint32_t)(_a) < (uint32_t)(_e)))

/**
 * \brief Address is in the remapped memory region
 */
#define IS_REMAPPED_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_REMAPPED_BASE, MEMORY_REMAPPED_END)

/**
 * \brief Address is in the ROM region
 */
#define IS_ROM_ADDRESS(_a)              WITHIN_RANGE((_a), MEMORY_ROM_BASE, MEMORY_ROM_END)

/**
 * \brief Address is in the OTP memory region
 */
/**
* \brief Address is in the SYSTEM RAM region
*/
#define IS_SYSRAM_ADDRESS(_a)           WITHIN_RANGE((_a), MEMORY_SYSRAM_BASE, MEMORY_SYSRAM_END)

/**
* \brief Address is in the SYSTEM RAM (code) region
*/
#define IS_SYSRAM_S_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_SYSRAM_S_BASE, MEMORY_SYSRAM_S_END)

/**
 * \brief Address is in the CACHE RAM region
 */
#define IS_CACHERAM_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_CACHERAM_BASE, MEMORY_CACHERAM_END)

/**
 * \brief Address is in the QSPI Flash memory region
 */
#define IS_QSPIF_ADDRESS(_a)            WITHIN_RANGE((_a), MEMORY_QSPIF_BASE, MEMORY_QSPIF_END)

/**
 * \brief Address is in the QSPI AHB-S(ystem) memory region
 */
#define IS_QSPIF_S_ADDRESS(_a)            WITHIN_RANGE((_a), MEMORY_QSPIF_S_BASE, MEMORY_QSPIF_S_END)

/**
 * \brief Address is in eFlash memory code region
 */
#define IS_EFLASH_ADDRESS(_a)      WITHIN_RANGE((_a), MEMORY_EFLASH_BASE, MEMORY_EFLASH_END)

/**
 * \brief Address is in eFlash memory data region
 */
#define IS_EFLASH_S_ADDRESS(_a)      WITHIN_RANGE((_a), MEMORY_EFLASH_S_BASE, MEMORY_EFLASH_S_END)

 /**
  * \brief The Sector Size of QSPI flash memories
  */
#define FLASH_SECTOR_SIZE              (0x1000)




/**
 * \brief The Virtual Base Address to access the Embedded Flash memory
 *
 */
#define EFLASH_MEM1_VIRTUAL_BASE_ADDR               (0x00000000)

/**
 * \brief The Virtual Base Address to access the QSPI Flash memory connected to QSPIC.
 *
 * \note  To ensure proper functioning, the QSPI virtual base address must be aligned with the QSPI
 *        flash sector size. Since the EFLASH size is not aligned with the QSPI flash sector size,
 *        this is handled by the macro.
 */
#define QSPI_MEM1_VIRTUAL_BASE_ADDR                 (((EFLASH_MEM1_VIRTUAL_BASE_ADDR + MEMORY_EFLASH_SIZE) \
                                                     & ~(FLASH_SECTOR_SIZE - 1)) + FLASH_SECTOR_SIZE)

/**
 * \brief Zero-initialized data retained memory attribute
 */
#define __RETAINED                      __attribute__((section("retention_mem_zi")))    // RetRAM0
#define __RETAINED_1                    __attribute__((section("retention_mem_1_zi")))  // RetRAM1

/**
 * \brief Initialized data retained memory attribute
 */
#define __RETAINED_RW                   __attribute__((section("retention_mem_init")))

/**
 * \brief Uninitialized data retained memory attribute. Used for variables that should
 * not be initialized during startup.
 */
#define __RETAINED_UNINIT               __attribute__((section("retention_mem_uninit")))

 /**
  * \brief Constant data retained memory attribute
  */
#define __RETAINED_CONST_INIT           __attribute__((section("retention_mem_const")))

/**
 * \brief Zero-initialized data retained memory attribute visible by CMAC
 */
#ifdef CONFIG_USE_BLE
#define __RETAINED_CMI                  __attribute__((section("retention_mem_cmi_zi")))
#else
#define __RETAINED_CMI                  __RETAINED
#endif /* CONFIG_USE_BLE */

/**
 * \brief Text retained memory attribute
 */
#define __RETAIN_CODE_ATTR              __attribute__((section("text_retained"))) __attribute__((noinline)) __attribute__((optimize ("no-tree-switch-conversion")))
# if dg_configREDUCE_RETAINED_CODE
// When the code is executed from eFlash if dg_configREDUCE_RETAINED_CODE == 1, the __ALWAYS_RETAINED_CODE attribute is used to selectively
// retain only the necessary functions in SysRAM. When dg_configREDUCE_RETAINED_CODE is set to 0, the system requires more functions to be retained in SysRAM.
// The __RETAINED_CODE and __ALWAYS_RETAINED_CODE attributes determine which functions will be retained.
// When the code is executed from QSPI the dg_configREDUCE_RETAINED_CODE can only be set to 0. The __RETAINED_CODE and __ALWAYS_RETAINED_CODE attributes determine which functions
// will be retained in RAM. Please refer to definition of dg_configREDUCE_RETAINED_CODE for more details.
#  if ((dg_configCODE_LOCATION == NON_VOLATILE_IS_EMBEDDED_FLASH) && \
     (dg_configEXEC_MODE == MODE_IS_CACHED))
#  define __RETAINED_CODE
#  define __ALWAYS_RETAINED_CODE        __RETAIN_CODE_ATTR
#  else /* RAM build */
#  define __RETAINED_CODE
#  define __ALWAYS_RETAINED_CODE
#  endif
# else /* dg_configREDUCE_RETAINED_CODE == 0 */
#  if (((dg_configCODE_LOCATION == NON_VOLATILE_IS_QSPI_FLASH) || \
    (dg_configCODE_LOCATION == NON_VOLATILE_IS_EMBEDDED_FLASH)) && \
    (dg_configEXEC_MODE == MODE_IS_CACHED))
#  define __RETAINED_CODE               __RETAIN_CODE_ATTR
#  define __ALWAYS_RETAINED_CODE        __RETAIN_CODE_ATTR
#  else /* RAM build */
#  define __RETAINED_CODE
#  define __ALWAYS_RETAINED_CODE
#  endif
# endif /* dg_configREDUCE_RETAINED_CODE */


