dianyundou/DA14592BLE_CSL/CSL-59x_10.679.2.17/sdk/bsp/include/sdk_defs.h
# if dg_configRETAIN_HOT_CODE
# define __RETAINED_HOT_CODE             __RETAINED_CODE
# else
# define __RETAINED_HOT_CODE
# endif

/**
 * \brief Attribute to silence warnings about unused parameters/variables/function
 */
#define __UNUSED                __attribute__((unused))

/**
 * \brief Attribute to tell the compiler to consider a symbol as externally visible (for LTO)
 */
#define __LTO_EXT               __attribute__((externally_visible))

// Forward declaration
__ALWAYS_RETAINED_CODE void hw_sys_assert_trigger_gpio(void);

/**
 * \brief Assert as warning macro
 *
 * \note Active only while in development mode
 */
#if (dg_configIMAGE_SETUP == DEVELOPMENT_MODE)
void assertion_functions_set_to_uninit(void);
void assertion_functions_set_to_init(void);

#define ASSERT_WARNING(a)       if (!(a)) {                                                                     \
                                        extern __NO_RETURN void (*assert_warning_func)(void);                   \
                                        register unsigned r4 __asm__("r4") = (uint32_t)&assert_warning_func;    \
                                        __asm__ volatile (                                                      \
                                                "  .syntax unified  \n"                                         \
                                                "LDR r4, [r4, #0]\n"                                            \
                                                "BX  r4 \n"                                                     \
                                                :                                                               \
                                                : "r" (r4)                                                      \
                                                : "r0","r1","r2","r3" /* force the compiler to avoid R0-R3 */   \
                                        );                                                                      \
                                        __builtin_unreachable();                                                \
                                }
#else
#define ASSERT_WARNING(a)       do { if (!(a)); } while (0);
#endif /* dg_configIMAGE_SETUP */
#define ASSERT_WARNING_UNINIT(a) ASSERT_WARNING(a)

/**
 * \brief Assert as error macro
 *
 */
#if (dg_configIMAGE_SETUP == DEVELOPMENT_MODE)
#define ASSERT_ERROR(a)         ASSERT_WARNING(a)
#else
#define ASSERT_ERROR(a)         if (!(a)) {                                                                     \
                                        __asm__ volatile (                                                      \
                                                "  .syntax unified  \n"                                         \
                                                "CPSID I\n"                                                     \
                                                "BKPT  2\n"                                                     \
                                                :                                                               \
                                                :                                                               \
                                                : "memory"                                                      \
                                        );                                                                      \
                                        __builtin_unreachable();                                                \
                                }
#endif /* dg_configIMAGE_SETUP */

#define ASSERT_ERROR_UNINIT(a)  ASSERT_ERROR(a)

/**
 * \brief Macro to disable all interrupts
 *
 * This macro must always be used with GLOBAL_INT_RESTORE(). E.g.
 *
 * \code{.c}
 * GLOBAL_INT_DISABLE();
 *  ... code to be executed with interrupts disabled ...
 * GLOBAL_INT_RESTORE();
 * \endcode
 *
 * \sa GLOBAL_INT_RESTORE
 */
#define GLOBAL_INT_DISABLE()                                                            \
        do {                                                                            \
                unsigned int __l_irq_rest;                                              \
                __ASM volatile ("mrs   %0, primask  \n\t"                               \
                              "mov   r1, $1     \n\t"                                   \
                              "msr   primask, r1  \n\t"                                 \
                              : "=r" (__l_irq_rest)                                     \
                              :                                                         \
                              : "r1"                                                    \
                              );                                                        \
               DBG_CONFIGURE_HIGH(CMN_TIMING_DEBUG, CMNDBG_CRITICAL_SECTION);

/**
 * \brief Macro to restore all interrupts
 *
 * This macro must always be used after GLOBAL_INT_DISABLE(). E.g.
 *
 * \code{.c}
 * GLOBAL_INT_DISABLE();
 *  ... code to be executed with interrupts disabled ...
 * GLOBAL_INT_RESTORE();
 * \endcode
 *
 * \sa GLOBAL_INT_DISABLE
 */
#define GLOBAL_INT_RESTORE()                                                            \
                if (__l_irq_rest == 0) {                                                \
                        DBG_CONFIGURE_LOW(CMN_TIMING_DEBUG, CMNDBG_CRITICAL_SECTION);   \
                }                                                                       \
                __ASM volatile ("msr   primask, %0  \n\t"                               \
                                                          :                             \
                                                          : "r" (__l_irq_rest)          \
                                                          :                             \
                                                          );                            \
        } while (0)

